Documents/ПланыПродаж.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Document>
		<Properties>
			<Name>ПланыПродаж</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ПланыПродаж</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТорговаяКоманда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Менеджеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НоменклатурнаяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Период1</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Период2</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СтрокиДокумента</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Менеджер</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Менеджеры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Продажи1</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Продажи2</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>План</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Поставщики</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НоменклатурнаяГруппа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПериодыАнализа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Период</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НормативыПоTQM</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Менеджер</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Менеджеры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КатегорияТТ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КД_КатегорииТТ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>TQM_обяз</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КоличествоНеотрицательное</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>TQM_рек</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КоличествоНеотрицательное</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоляПолки</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КоличествоНеотрицательное</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/Продажи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<AccumulationRegister>
		<Properties>
			<Name>Продажи</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КоличествоОтрицательное</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПродСтоимость</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.СуммаОтрицательная</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Доход</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.СуммаОтрицательная</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаСкидки</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.СуммаОтрицательная</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Вес</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КоличествоОтрицательное</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ТипЦены</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоВозврат</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентСкидки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Менеджеры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МаршрутРазвоза</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МаршрутыРазвоза</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КредитныйДокумент</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РасходнаяНакладная</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЦФО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОтделыВМагазинах</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КаналСбыта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КД_КаналыСбыта</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГруппаПродукта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КД_ГруппыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РазделительУчёта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РазделителиУчёта</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/ПланыПродаж/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ЗаполнитьДокументСервер()
	
	Объект.СтрокиДокумента.Очистить();
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Менеджер,
	|	СУММА(ВложенныйЗапрос.Продажи1) КАК Продажи1,
	|	СУММА(ВложенныйЗапрос.Продажи2) КАК Продажи2
	|ИЗ
	|	(ВЫБРАТЬ
	|		ПродажиОбороты.Менеджер КАК Менеджер,
	|		ПродажиОбороты.КоличествоОборот * ПродажиОбороты.Номенклатура.Вес КАК Продажи1,
	|		0 КАК Продажи2
	|	ИЗ
	|		РегистрНакопления.Продажи.Обороты(
	|				&НачалоПериода1,
	|				&КонецПериода1,
	|				,
	|				Подразделение = &Подразделение
	|					И Менеджер В ИЕРАРХИИ (&ТорговаяКоманда)
	|					И Номенклатура В ИЕРАРХИИ (&НоменклатурнаяГруппа)) КАК ПродажиОбороты
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ПродажиОбороты.Менеджер,
	|		0,
	|		ПродажиОбороты.КоличествоОборот * ПродажиОбороты.Номенклатура.Вес
	|	ИЗ
	|		РегистрНакопления.Продажи.Обороты(
	|				&НачалоПериода2,
	|				&КонецПериода2,
	|				,
	|				Подразделение = &Подразделение
	|					И Менеджер В ИЕРАРХИИ (&ТорговаяКоманда)
	|					И Номенклатура В ИЕРАРХИИ (&НоменклатурнаяГруппа)) КАК ПродажиОбороты) КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Менеджер
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВложенныйЗапрос.Менеджер.Наименование");
	
	Запрос.УстановитьПараметр("Подразделение", Объект.Подразделение);
	Запрос.УстановитьПараметр("ТорговаяКоманда", Объект.ТорговаяКоманда);
	Запрос.УстановитьПараметр("НоменклатурнаяГруппа", Объект.НоменклатурнаяГруппа);
	
	Запрос.УстановитьПараметр("НачалоПериода1", НачалоМесяца(Объект.Период1));
	Запрос.УстановитьПараметр("КонецПериода1", КонецМесяца(Объект.Период1));
	
	Запрос.УстановитьПараметр("НачалоПериода2", НачалоМесяца(Объект.Период2));
	Запрос.УстановитьПараметр("КонецПериода2", КонецМесяца(Объект.Период2));
	
	Объект.СтрокиДокумента.Загрузить(Запрос.Выполнить().Выгрузить() );
	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДокумент(Команда)
	ЗаполнитьДокументСервер();
КонецПроцедуры
